app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("name", "artist", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Donu Donu"], ["artist", "Anirudh"], ["created_at", "2015-08-12 06:48:59.880433"], ["updated_at", "2015-08-12 06:48:59.880433"]]